JUSTiceMaMo/contest2026_272_tokenwujixian/chips/bk7258/wifi/armino/glue/bk_wifi/src/rwnx_rx.c
/* NuttX port: the prologue below came from a wrapper translation unit
 * at wifi/hal_port/vendor_sources/rwnx_rx.c, which existed only to include this
 * file.  The build lists this file directly now.
 */
/* Wi-Fi-only translation unit: establish Armino's global build contract. */
#include <bk_prelude.h>
#include "driver.h"

#include <common/bk_include.h>

#include "stdio.h"
#include "string.h"
#include "rwnx_config.h"
#include "fhost_msg.h"
#include "rwnx_rx.h"
#include "rw_msdu.h"
#include "sk_intf.h"
#include "rwnx_defs.h"
#include "main_none.h"
#include "wpa_ctrl.h"
#include "ctrl_iface.h"

#if CONFIG_AP_PROBEREQ_CB
#include "rw_msg_rx.h"
#endif
#if 1//CONFIG_RWNX_PROTO_DEBUG
#include "rwm_proto.h"
#endif
#include "rwnx_misc.h"
#include "pbuf.h"
#include "ieee802_11_defs.h"
#include "bk_phy_internal.h"
#include "prot/ethernet.h"
#include <os/str.h>
#include <lwip/def.h>
#include "generated/lmac_msg.h"
#include "bk7258_scan_diag.h"
#if CONFIG_WIFI_VNET_CONTROLLER
#include "controller_wifi_if.h"
#endif
#ifdef CONFIG_P2P
#include "fhost_msg.h"
#endif
void ethernetif_input(int iface, struct pbuf *p, uint8_t dst_idx);
wifi_monitor_cb_t wifi_monitor_get_cb(void);
#define LLC_ETHERTYPE_IPX            0x8137

/// Structure of A-MSDU Header
struct amsdu_hdr
{
    /// Destination Address
    struct eth_addr dest;
    /// Source Address
    struct eth_addr src;
    /// Length
    uint16_t len;
} __PACKED;

/// LLC/SNAP structure
struct llc_snap_short
{
    /// DSAP + SSAP fieldsr
    uint16_t dsap_ssap;
    /// LLC control + OUI byte 0
    uint16_t control_oui0;
    /// OUI bytes 1 and 2
    uint16_t oui1_2;
};

/// LLC/SNAP structure
struct llc_snap
{
    /// DSAP + SSAP fieldsr
    uint16_t dsap_ssap;
    /// LLC control + OUI byte 0
    uint16_t control_oui0;
    /// OUI bytes 1 and 2
    uint16_t oui1_2;
    /// Protocol
    uint16_t proto_id;
};

extern struct llc_snap_short llc_rfc1042_hdr;
extern struct llc_snap_short llc_bridge_tunnel_hdr;

#define RWM_MAC_ADDR_IS_BSCT(addr1_ptr)                                                     \
    ((*(((uint8_t*)(addr1_ptr)) + 0) == 0xFF) &&                                        \
     (*(((uint8_t*)(addr1_ptr)) + 1) == 0xFF) &&                                        \
     (*(((uint8_t*)(addr1_ptr)) + 2) == 0xFF) &&                                        \
     (*(((uint8_t*)(addr1_ptr)) + 3) == 0xFF) &&                                        \
     (*(((uint8_t*)(addr1_ptr)) + 4) == 0xFF) &&                                        \
     (*(((uint8_t*)(addr1_ptr)) + 5) == 0xFF))

#define RWM_MAC_ADDR_IS_MULTI(addr1_ptr)                                                    \
    ((*(((uint8_t*)(addr1_ptr)) + 0) == 0x01) &&                                        \
     (*(((uint8_t*)(addr1_ptr)) + 1) == 0x00) &&                                        \
     (*(((uint8_t*)(addr1_ptr)) + 2) == 0x5E))

void ethernetif_input(int iface, struct pbuf *p, uint8_t dst_idx);

static bool rwm_udp_filter(struct ipv4_hdr *ip_hdr)
{
	char *udp_tmp = (char *)ip_hdr + IP_HDR_LEN;
	struct udphdr *udphdr = (struct udphdr *)udp_tmp;

	if (((htons(DHCP_SPORT(udphdr)) == 68) && (htons(DHCP_DPORT(udphdr)) == 67)) ||
		((htons(DHCP_SPORT(udphdr)) == 67) && (htons(DHCP_DPORT(udphdr)) == 68))) {
		/*dhcp message of udp*/
		return true;
	} else {
		return false;
	}
}

static bool rwm_ip_filter(struct ethhdr *eth_hdr_ptr)
{
	bool finded = false;
	char *tmp = (char *)eth_hdr_ptr + ETHDR_LEN;
	struct ipv4_hdr *iphdr = (struct ipv4_hdr *)tmp;

	switch (IP4H_PROTO(iphdr)) {
	case 17:	 //IP_PROTO_UDP
		finded =  rwm_udp_filter(iphdr);
		break;
	default:	 //UNKNOW TYPE
		break;
	}
	return finded;
}

static bool rwm_proto_filter(struct ethhdr *eth_hdr_ptr)
{
	bool finded = false;
	switch (htons(eth_hdr_ptr->proto)) {
	case 0x0800U:	 //ETHTYPE_IP
		finded = rwm_ip_filter(eth_hdr_ptr);
		break;
	case 0x0806U:	 //ETHTYPE_ARP
		finded = true;
		break;
	default:
		break;
	}
	return finded;
}

static bool rwm_block_bcmc(struct ethhdr *eth_hdr_ptr,uint8_t type)
{
	bool is_multi = RWM_MAC_ADDR_IS_MULTI(eth_hdr_ptr->dest);
	bool is_bsct = RWM_MAC_ADDR_IS_BSCT(eth_hdr_ptr->dest);

	switch(type)
	{
		case WIFI_MC_ON:
			if(is_multi && (!rwm_proto_filter(eth_hdr_ptr)))
			{
				return true;
			}
			break;
		case WIFI_BC_ON:
			if(is_bsct && (!rwm_proto_filter(eth_hdr_ptr)))
			{
				return true;
			}
			break;
		case WIFI_BC_MC_ON:
			if((is_bsct || is_multi) && (!rwm_proto_filter(eth_hdr_ptr)))
			{
				return true;
			}
			break;

		default:
			break;
		
	}
	return false;
}

void fhost_msdu_init()
{
}

void rwm_check_rx_header_pattern(void *host_id)
{
	struct pbuf *p = NULL;
	struct fhost_rx_header *rxhdr = NULL;

	if (!rwm_check_rx_header_pattern_enabled())
		return;

	if (!host_id)
	{
		RWNX_LOGE("host_id is NULL\n");
		BK_ASSERT(0);
	}

	p = (struct pbuf *)host_id;
	rxhdr = (struct fhost_rx_header *)p->payload;

	if (!rxhdr)
	{
		RWNX_LOGE("rxhdr is NULL\n");
		BK_ASSERT(0);
	}

	if (rxhdr->pattern != DMA_HD_RXPATTERN)
	{
		RWNX_LOGE("pattern:%x, offsetof %d\n", rxhdr->pattern, offsetof(struct fhost_rx_header, pattern));
		BK_ASSERT(0);
	}

	if (rxhdr->flags_is_amsdu)
	{
		RWNX_LOGV("amsdu_pattern:%x\n", rxhdr->amsdu_pattern);
		BK_ASSERT(rxhdr->amsdu_pattern == RX_AMSDU_RXPATTERN);
	}
}

/* Get RX Buffer */
UINT32 rwm_get_rx_free_node(uint32_t *host_id, int len)
{
	uint32_t buf_addr;
	struct pbuf *p;
#if MEM_TRX_DYNAMIC_EN
	pbuf_type type = PBUF_RAM_RX;
#else
	pbuf_type type = PBUF_POOL;

	/*
	 * When requested pbuf type is PBUF_POOL, pbuf_alloc will return a valid memory address even the
	 * requested length is greater than PBUF_POOL_BUFSIZE, and it will lead to memory OVERFLOW when
	 * memory is free, so a condition is added to ensure do NOT alloc buffer from PBUF pool if the
	 * requested length is greater than PBUF_POOL_BUFSIZE
	 */
	if (len > PBUF_POOL_BUFSIZE)
	{
		type = PBUF_RAM;
	}
#endif
#if CONFIG_WIFI_VNET_CONTROLLER
	len += sizeof(struct cpdu_t);
#endif
	p = pbuf_alloc(PBUF_RAW, len, type);
	if (p) {
		*host_id = (uint32_t)p;
#if CONFIG_WIFI_VNET_CONTROLLER
		pbuf_header(p, -(s16)sizeof(struct cpdu_t));
#endif
		buf_addr = (uint32_t)(p->payload);
	} else {
		*host_id = 0;
		buf_addr = 0;
	}
	//if (!buf_addr)
	//    BK_LOGD(NULL,"%s: xxxxxxxxxx oom\n", __func__);
	return buf_addr;
}

/**
 * Extract frequency in MHz from phy_info
 * @param phy_info: PHY channel information (by value)
 * @return: Frequency in MHz, or 0 if invalid
 */
static uint32_t rwnx_phy_info_to_freq(struct phy_channel_info phy_info)
{
	uint32_t freq = 0;
	uint8_t band;
	uint16_t channel;
	uint16_t cent_freq1;

	/* Try to get center frequency 1 first (most accurate) */
	cent_freq1 = PHY_INFO_CENT_FREQ1(phy_info);
	if (cent_freq1 > 0) {
		freq = cent_freq1;
	} else {
		/* Fallback: calculate from band and channel */
		band = PHY_INFO_BAND(phy_info);
		channel = PHY_INFO_CHAN(phy_info);
		if (band == PHY_BAND_2G4 && channel >= 1 && channel <= 14) {
			/* 2.4GHz band: 2407 + channel * 5, except channel 14 = 2484 */
			if (channel == 14)
				freq = 2484;
			else
				freq = 2407 + channel * 5;
		} else if (band == PHY_BAND_5G && channel >= 1 && channel <= 165) {
			/* 5GHz band: 5000 + channel * 5 */
			freq = 5000 + channel * 5;
		}
	}

	return freq;
}

/**
 * rwnx_rx_mgmt - Process one 802.11 management frame
 *
 * @pbuf: pbuf received
 * @rxhdr: HW rx descriptor
 *
 * return: dont_free: 0: need free pbuf, 1: dont free pbuf
 *
 * Process the management frame and free the corresponding skb.
 * If vif is not specified in the rx descriptor, the the frame is uploaded
 * on all active vifs.
 */
static int rwnx_rx_mgmt(struct pbuf *p, struct fhost_rx_header *rxhdr, int vif_idx)
{
	struct ieee80211_mgmt *mgmt = (struct ieee80211_mgmt *)p->payload;
#if (CONFIG_SOC_BK7236XX) || CONFIG_SOC_BK7239XX || CONFIG_SOC_BK7286XX
	void *vif;

	if (vif_idx >= NX_VIRT_DEV_MAX)
		return 0;

	vif = mac_vif_mgmt_get_entry(vif_idx);
#endif

	if (ieee80211_is_beacon(mgmt->frame_control)) {
		bk7258_scan_diag_record(BK7258_SCAN_DIAG_HOST_MGMT_BEACON);
#if (CONFIG_SOC_BK7236XX) || CONFIG_SOC_BK7239XX || CONFIG_SOC_BK7286XX // FIXME: bk7236, small memory now (need to enable other memory section)
		// cfg80211_report_obss_beacon
		if (mac_vif_mgmt_get_type(vif) == VIF_STA)
			return 0;
#endif
		if (!is_wpah_queue_full()) {
			struct ke_sk_params params = {
				.buf = p->payload,
				.len = p->len,
				.flag = vif_idx,
				.freq = rwnx_phy_info_to_freq(rxhdr->phy_info)
			};
			ke_mgmt_packet_tx(&params);
			bk7258_scan_diag_record(BK7258_SCAN_DIAG_HOST_MGMT_WPAQ_FORWARDED);
		} else {
			bk7258_scan_diag_record(BK7258_SCAN_DIAG_HOST_MGMT_WPAQ_DROP);
		}
		return 0;
	} else if ((ieee80211_is_deauth(mgmt->frame_control) ||
				ieee80211_is_disassoc(mgmt->frame_control)) &&
			   (mgmt->u.deauth.reason_code == WLAN_REASON_CLASS2_FRAME_FROM_NONAUTH_STA ||
				mgmt->u.deauth.reason_code == WLAN_REASON_CLASS3_FRAME_FROM_NONASSOC_STA)) {
		int ret;

		pbuf_ref(p);

		if (mgmt->u.deauth.reason_code == WLAN_REASON_CLASS2_FRAME_FROM_NONAUTH_STA)
			ret = wpa_ctrl_event(WPA_CTRL_EVENT_UNPROT_DEAUTHENTICATE, p);
		else
			ret = wpa_ctrl_event(WPA_CTRL_EVENT_UNPROT_DISASSOCIATE, p);

		if (ret != BK_OK)
			pbuf_free(p);

