JUSTiceMaMo/contest2026_272_tokenwujixian/chips/bk7258/wifi/armino/glue/bk_wifi/src/rwnx_rx.c
		return 0;
	} else {
		if (ieee80211_is_probe_resp(mgmt->frame_control))
			bk7258_scan_diag_record(BK7258_SCAN_DIAG_HOST_MGMT_PROBE_RESP);
#if CONFIG_AP_PROBEREQ_CB
		if (ieee80211_is_probe_req(mgmt->frame_control))
			ap_vif_probe_req_frame_cb_hander(p->payload, p->len);
#endif

#if (CONFIG_SOC_BK7236XX) || CONFIG_SOC_BK7239XX || CONFIG_SOC_BK7286XX
		// FIXME: bk7236, don't pass probe req to wpa_s unless CONFIG_P2P is enabled
		if (mac_vif_mgmt_get_type(vif) == VIF_STA) {
#if !CONFIG_P2P
			if (ieee80211_is_probe_req(mgmt->frame_control) ||
				ieee80211_is_probe_resp(mgmt->frame_control)) {
				return 0;
			}
#endif
		}
#endif
		if (!is_wpah_queue_full())
		{
			struct ke_sk_params params = {
				.buf = p->payload,
				.len = p->len,
				.flag = vif_idx,
				.freq = rwnx_phy_info_to_freq(rxhdr->phy_info)
			};
			ke_mgmt_packet_tx(&params);
			if (ieee80211_is_probe_resp(mgmt->frame_control))
				bk7258_scan_diag_record(BK7258_SCAN_DIAG_HOST_MGMT_WPAQ_FORWARDED);
		}
		else if (ieee80211_is_probe_resp(mgmt->frame_control))
		{
			bk7258_scan_diag_record(BK7258_SCAN_DIAG_HOST_MGMT_WPAQ_DROP);
		}
		return 0;
	}
}

static int rwnx_get_specific_vif_id(int vif_type)
{
	void *vif;

	for (int i = 0; i < NX_VIRT_DEV_MAX; i++)  {
		vif = mac_vif_mgmt_get_entry(i);
		if (mac_vif_mgmt_get_type(vif) == vif_type)
			return mac_vif_mgmt_get_index(vif);
	}

	return INVALID_VIF_IDX;
}

#if CONFIG_P2P
static int rwnx_get_probe_req_vif_id( )
{
	void *vif;
	for (int i = 0; i < NX_VIRT_DEV_MAX; i++){
		vif = mac_vif_mgmt_get_entry(i);
		if ((VIF_STA == mac_vif_mgmt_get_type(vif)) && (mac_vif_mgmt_p2p_can_rec_probe_req(vif)))
			return mac_vif_mgmt_get_index(vif);
	}

	for (int i = 0; i < NX_VIRT_DEV_MAX; i++){
		vif = mac_vif_mgmt_get_entry(i);
		if (VIF_AP == mac_vif_mgmt_get_type(vif))
			return mac_vif_mgmt_get_index(vif);
	}

	return INVALID_VIF_IDX;
}
#endif

/**
 * rwnx_rx_mgmt_any - Process one 802.11 management frame
 *
 * @rwnx_hw: main driver data
 * @skb: skb received
 * @rxhdr: HW rx descriptor
 *
 * Process the management frame and free the corresponding skb.
 * If vif is not specified in the rx descriptor, the the frame is uploaded
 * on all active vifs.
 */
static void rwnx_rx_mgmt_any(struct pbuf *p, struct fhost_rx_header *rxhdr)
{
	int vif_idx = rxhdr->flags_vif_idx;

	if (vif_idx == INVALID_VIF_IDX) {
		struct ieee80211_mgmt *hdr = (struct ieee80211_mgmt *)p->payload;
		int dest_vif;

		/* Ways to mitigate forwarding too many pkts to supplicant:
		 *
		 * 1. Forward beacon/probe response to STA only
		 * 2. Forware probe request to AP only
		 *
		 * TODO - flow control for pkts to supplicant
		 **/
		if (ieee80211_is_beacon(hdr->frame_control) || ieee80211_is_probe_resp(hdr->frame_control))
			dest_vif = rwnx_get_specific_vif_id(VIF_STA);
		else if (ieee80211_is_probe_req(hdr->frame_control))
#if CONFIG_P2P
			dest_vif = rwnx_get_probe_req_vif_id();
#else
			dest_vif = rwnx_get_specific_vif_id(VIF_AP);
#endif
		else
			dest_vif = INVALID_VIF_IDX;

		if (dest_vif != INVALID_VIF_IDX)
			rwnx_rx_mgmt(p, rxhdr, dest_vif);
		else if (ieee80211_is_beacon(hdr->frame_control) ||
			 ieee80211_is_probe_resp(hdr->frame_control))
			bk7258_scan_diag_record(BK7258_SCAN_DIAG_HOST_MGMT_NO_STA_VIF);
	} else {
		rwnx_rx_mgmt(p, rxhdr, vif_idx);
	}

	pbuf_free(p);
}

void rwnx_amsdu_mac2eth_update(struct pbuf *p)
{
	struct mac_addr temp_mac;
	struct llc_snap *llc_snap;
	struct eth_hdr *eth_hdr;
	struct amsdu_hdr *amsdu_subfrm_hdr = (struct amsdu_hdr *)p->payload;

	#if 0//(RW_MESH_EN)
	VIF_INF_PTR p_vif_entry = rwm_mgmt_vif_idx2ptr(rxhdr->flags_vif_idx);
	#endif //(RW_MESH_EN)

	/*
	 * format of p->payload
	 * 1 MESH type
	 ****************************************************
	 *  |  DA  |  SA  |  LENGTH  |  MESH_CONTROL  |  DATA  |  PADDING  |
	 ****************************************************
	 * 2 SNAP type
	 ***********************************************************************
	 *  |  DA  |  SA  |  LENGTH  |  LLC/SNAP  |  DATA  |  PADDING  |
	 ***********************************************************************
	 * 3 RAW type (should not happen actually)
	 ****************************************************
	 *  |  DA  |  SA  |  LENGTH  |  DATA  |  PADDING  |
	 ****************************************************
	 */

	//BK_LOGD(NULL,"%s amsdu_len=%d\n", __FUNCTION__, p->len);

	//ieee802.11 amsdu_hdr to ieee802.3 mac_eth_hdr
#if 0//(RW_MESH_EN)
	if ((p_vif_entry->type == VIF_MESH_POINT) && (rxhdr->flags_dst_idx != INVALID_STA_IDX)) {
		/*
		    ****************************************************
		    *  |  DA  |  SA  |  LENGTH  |  MESH_CONTROL  |  LLC/SNAP    |  DATA  |  PADDING  |
		    ****************************************************
		    * ==>
		    ****************************************************
		    *  |  DA  |  SA  |  ETHERTYPE  |  MESH_CONTROL  |  LLC/SNAP    |  DATA  |  PADDING  |
		    ****************************************************
		    *  Keep subframe as mesh frame, since amsdu_hdr=mac_eth_hdr
		    *  set eth_hdr->len as ethertype like rxu_cntrl_mac2eth_update
		    */
		eth_hdr = (struct mac_eth_hdr *)amsdu_subfrm_hdr;
		llc_snap = (struct llc_snap *)((uint8_t *)amsdu_subfrm_hdr + sizeof(struct mac_eth_hdr) + rxhdr->mesh_ctrl_len);
		eth_hdr->len = llc_snap->proto_id;
	} else
#endif //(RW_MESH_EN)

	llc_snap = (struct llc_snap *)(amsdu_subfrm_hdr + 1);

	if ((!memcmp(llc_snap, &llc_rfc1042_hdr, sizeof(llc_rfc1042_hdr))
		 //&& (llc_snap->ether_type != RX_ETH_PROT_ID_AARP) - Appletalk depracated ?
		 && (llc_snap->proto_id != LLC_ETHERTYPE_IPX))
		|| (!memcmp(llc_snap, &llc_bridge_tunnel_hdr, sizeof(llc_bridge_tunnel_hdr)))) {
		/*
			****************************************************
			*  |  DA  |  SA  |	LENGTH	|  LLC/SNAP  |	DATA  |  PADDING  |
			****************************************************
			* ==>
			****************************************************
			*  |  DA  |  SA  |	DATA  |  PADDING  |
			****************************************************
			*/
		eth_hdr = (struct eth_hdr *)((uint8_t *)amsdu_subfrm_hdr + sizeof(struct llc_snap_short) + sizeof(amsdu_subfrm_hdr->len));
		os_memcpy(&eth_hdr->src, &amsdu_subfrm_hdr->src, ETH_ALEN);
		os_memcpy(&eth_hdr->dest, &amsdu_subfrm_hdr->dest, ETH_ALEN);

		pbuf_header(p, -(s16)(sizeof(struct llc_snap_short) + sizeof(amsdu_subfrm_hdr->len)));	// skip off
	} else {
		/*
			****************************************************
			*  |  DA  |  SA  |	LENGTH	|  DATA  |	PADDING  |
			****************************************************
			* ==>
			****************************************************
			*  |  DA  |  SA  |	DATA  |  PADDING  |
			****************************************************
			*/
		eth_hdr = (struct eth_hdr *)((uint8_t *)amsdu_subfrm_hdr + sizeof(amsdu_subfrm_hdr->len));
		os_memcpy(&temp_mac, &amsdu_subfrm_hdr->src, ETH_ALEN);
		os_memcpy(&eth_hdr->src, &temp_mac, ETH_ALEN);
		os_memcpy(&temp_mac, &amsdu_subfrm_hdr->dest, ETH_ALEN);
		os_memcpy(&eth_hdr->dest, &temp_mac, ETH_ALEN);

		pbuf_header(p, -(s16)sizeof(amsdu_subfrm_hdr->len));	// skip off
	}

