JUSTiceMaMo/contest2026_272_tokenwujixian/chips/bk7258/wifi/armino/glue/bk_wifi/src/rwnx_rx.c
}

/**
 ****************************************************************************************
 * @brief process all the A-MSDU subframes
 * @param[in] rxhdr - the fhost rx header which contains all the address of subframes in
 *                    A-MSDU, the address of subframes are stored in rxhdr->amsdu_hostids
 *
 * BK A-MSDU buffer allocation strategy:
 *
 * To save memory usage, the RX buffer is only malloced with known size after the length
 * of each subframe in A-MSDU is parsed.
 *
 * amsdu_hostids[0] contains fhost_rx_header and the payload of first subframe in A-MSDU,
 * amsdu_hostids[N] contains only the payload of subframe(#n+1) in A-MSDU, which N meets
 * the condition as follow:(N != 0 && N < NX_MAX_MSDU_PER_RX_AMSDU).
 ****************************************************************************************
 */
void rwnx_upload_amsdu(struct fhost_rx_header *rxhdr)
{
	// Iterate sub-MSDU of A-MSDU
	int i = 0;
	uint32_t amsdu_hostids[NX_MAX_MSDU_PER_RX_AMSDU];
	int iface = 0;
	struct pbuf *q;

	os_memcpy(amsdu_hostids, rxhdr->amsdu_hostids, sizeof(amsdu_hostids));
	iface = rxhdr->flags_vif_idx;

	// upload the other sub-MSDUs of A-MSDU
	q = (struct pbuf *)(amsdu_hostids[i]);

	while (q) {

		#if NX_VERSION > NX_VERSION_PACK(6, 22, 0, 0)
		/* preprocess for pbuf */
		rwnx_rx_preprocess(iface, q);
		#endif
		/* upload to tcp/ip stack */
		ethernetif_input(iface, q, rxhdr->flags_dst_idx);

		/* get the next sub-MSDU */
		i++;
		if(i < NX_MAX_MSDU_PER_RX_AMSDU)
			q = (struct pbuf *)(amsdu_hostids[i]);
		else
			break;
	}
}


/**
 * rwm_upload_data - upload 802.3 frame to lwip, and 802.11 frame to wpa_s/hostapd
 *
 * @host_id: pbuf address
 * @frame_len: 802.3/802.11 frame len
 */

#if CONFIG_RWNX_PROTO_DEBUG
extern uint8_t proto_debug_flag;
#endif
UINT32 rwm_upload_data(void *host_id, uint32_t frame_len)
{
	/*
	 * +-----  host_id (struct pbuf{} *)
	 * |
	 * V
	 * +----------+-------------------+
	 * |  rxvect  |   IEEE 802.3 Data |
	 * +----------+-------------------+
	 */
	struct fhost_rx_header *rxhdr;
	struct pbuf *p;
	struct pbuf *q;
	//struct mem *p_mem = NULL;
	STA_INF_PTR sta_entry;
#if (CONFIG_SOC_BK7236XX)
	VIF_INF_PTR vif_entry;
#endif

	if (!host_id)
		return BK_FAIL;

	rwm_check_rx_header_pattern(host_id);

	p = (struct pbuf *)host_id;

	//p_mem = (struct mem *)((uint8_t *)p - 8);
	//WIFI_ASSERT(p_mem->used);

	/* TBD: Do we need to linearize pbuf here ? Will lwip do the work */
	if (p->next) {
		q = (struct pbuf *)pbuf_coalesce(p, PBUF_RAW);
		if (q == p) // OOM
			RWNX_LOGE("nonlinear pbuf\n");
	} else {
		q = p;
	}

	q->len = frame_len + macif_get_rxl_payload_offset();
	rxhdr = (struct fhost_rx_header *)q->payload;

	pbuf_header(q, -(s16)macif_get_rxl_payload_offset());

	/* record rssi */
	sta_entry = rwm_mgmt_sta_idx2ptr(rxhdr->flags_sta_idx);
	if (sta_entry) {
#if CONFIG_WIFI6
		int8_t modf, mcs;

		/* byte 5 from recvect, refer MAC-PHY-IF-FS */
		//sta_entry->rssi = (rxhdr->hwvect.recvec1a >> 16) & 0xff; //the same with recvec1b[15:8]
		sta_mgmt_set_rssi(sta_entry, (rxhdr->hwvect.recvec1b >> 8) & 0xff);
		sta_mgmt_set_freq_offset(sta_entry, (rxhdr->hwvect.recvec2a >> 24) & 0xff);
		modf    = rxhdr->hwvect.recvec1a & 0xf;
		if (modf < 2) {
			mcs = (rxhdr->hwvect.recvec1b >> 4) & 0xf;   //nonht
		} else if (modf < 4) {
			mcs = (rxhdr->hwvect.recvec1b >> 24) & 0x7f; //htmf & htgf
		} else if (modf < 5) {
			mcs = (rxhdr->hwvect.recvec1c >> 8) & 0xf;   //vht
		} else {
			mcs = rxhdr->hwvect.recvec1d & 0xf;         //he
		}

		if (modf == 0 && mcs < 4) {
			sta_mgmt_set_freq_offset(sta_entry, (int8_t)(((float)(int)-sta_mgmt_get_freq_offset(sta_entry)) / 1.35));
		}
#else
		sta_mgmt_set_rssi(sta_entry, (rxhdr->hwvect.recvec1c >> 24) & 0xff);
		sta_mgmt_set_freq_offset(sta_entry, 0xff);
#endif
#if (CONFIG_SOC_BK7236XX)
		vif_entry = rwm_mgmt_vif_idx2ptr(rxhdr->flags_vif_idx);
		if ((NULL != vif_entry) && (VIF_STA == mac_vif_mgmt_get_type(vif_entry))) {
			bk7011_update_by_rx(sta_mgmt_get_rssi(sta_entry), sta_mgmt_get_freq_offset(sta_entry));
		}
#endif
	}
	if (rxhdr->flags_is_80211_mpdu) {
		rwnx_rx_mgmt_any(q, rxhdr);
	} else if (rxhdr->flags_is_amsdu) {
		/* A-MSDU subframe, convert like `rxu_cntrl_mac2eth_update()' and then pass it to lwip */
		RWNX_LOGV("rx_up_data len_p:%x,len_q:%x,p_next:%x,p_totlen:%x,p_payload:%x,q_payload:%x\n",
		p->len,q->len,p->next,p->tot_len,p->payload,q->payload);

		RWNX_LOGV("data_flag flag:%x \n", rxhdr->flags_is_amsdu);
		rwnx_upload_amsdu(rxhdr);
	} else {
#if CONFIG_RWNX_PROTO_DEBUG
		if(proto_debug_flag) {
			struct ethhdr *eth_hdr_ptr;
			eth_hdr_ptr = (struct ethhdr *)q->payload;
			rwm_proto_printf(1, eth_hdr_ptr);
		}
#endif

#if NX_VERSION > NX_VERSION_PACK(6, 22, 0, 0)
		/* preprocess for pbuf */
		rwnx_rx_preprocess(rxhdr->flags_vif_idx, q);
#endif
		if(bk_wifi_get_block_bcmc_en())
		{
			if(rwm_block_bcmc((struct ethhdr *)q->payload,bk_wifi_get_block_bcmc_en()))
			{
				pbuf_free(p);
				p = NULL;
				return BK_OK;
			}
		}
		/* for 802.3 frame, pass it to lwip */
		ethernetif_input(rxhdr->flags_vif_idx, q, rxhdr->flags_dst_idx);
	}

	return BK_OK;
}

/**
 * NOTE: monitor frame is converted to 802.3 frame if the original
 * 802.11 frameis Data format, but the 802.11 mac header is backed
 * up to `fhost_rx_header.mac_hdr_backup'.
 *
 * host_id: struct pbuf *
 * frame_len: ieee80211 len(rxvect not included)
 */
UINT32 rwm_rx_monitor(void *host_id, uint32_t frame_len)
{
	wifi_monitor_cb_t cb;
	cb = wifi_monitor_get_cb();
	int8_t rssi;
	int8_t rx_rssi[2];

	if (cb) {
		wifi_frame_info_t frame_info;
		struct fhost_rx_header *rxhdr;
		struct pbuf *p;

		p = (struct pbuf *)host_id;
		p->len = frame_len + macif_get_rxl_payload_offset();
		rxhdr = (struct fhost_rx_header *)p->payload;

		pbuf_header(p, -(s16)macif_get_rxl_payload_offset());	// strip rxvect

		rssi = macif_rx_monitor_get_rssi(rxhdr->hwvect.recvec1b,rx_rssi);
		frame_info.rssi = rssi;
		frame_info.len = rxhdr->hwvect.len;
		frame_info.tsf_hi = rxhdr->hwvect.tsf_hi;
		frame_info.tsf_lo = rxhdr->hwvect.tsf_lo;
		frame_info.recvec1a = rxhdr->hwvect.recvec1a;
		frame_info.recvec1b = rxhdr->hwvect.recvec1b;
		frame_info.recvec1c = rxhdr->hwvect.recvec1c;
		frame_info.recvec1d = rxhdr->hwvect.recvec1d;
		frame_info.recvec2a = rxhdr->hwvect.recvec2a;
		frame_info.recvec2b = rxhdr->hwvect.recvec2b;

