JUSTiceMaMo/contest2026_272_tokenwujixian/chips/bk7258/wifi/armino/glue/bk_wifi/src/rwnx_rx.c
		/*
		 * payload is 802.3 format if original 802.11 is Data format, see
		 * function `rxu_cntrl_mac2eth_update()'.
		 */
		cb(p->payload, frame_len, &frame_info);

		// recovery pbuf for rwm_upload_data if needed
		pbuf_header(p, (s16)macif_get_rxl_payload_offset());
	}

	return 0;
}

int fhost_rxbuf_push()
{
#if !BK_MIN_RX_BUFSZ
#if CONFIG_LWIP
	/*
	 * +------+----------+-------------------+
	 * | pbuf |  rxvect  |   IEEE 802.3 Data |
	 * +------+----------+-------------------+
	 */
	struct pbuf *pbuf;

	pbuf = pbuf_alloc(PBUF_RAW, CFG_MSDU_MAX_LEN, PBUF_RAM);
	if (!pbuf) {
		RWNX_LOGD("%s alloc pbuf fail\r\n", __func__);
		return -ENOMEM;
	}

	if (pbuf && fhost_rxbuf_repush((uint32_t)pbuf)) {
		// queue failed, free pbuf
		pbuf_free(pbuf);
	}

	BUILD_BUG_ON(sizeof(struct fhost_rx_header) != RXL_HEADER_INFO_LEN);

#else
	uint8_t *payload;

	payload = ke_malloc(CFG_MSDU_MAX_LEN);
	if (!payload) {
		RWNX_LOGD("%s alloc payload fail\r\n", __func__);
		return -ENOMEM;
	}

	if (fhost_rxbuf_repush((uint32_t)payload))
		ke_free(payload);
#endif
#endif //!BK_MIN_RX_BUFSZ

	return 0;
}

void fhost_free_rx_buffer(uint32 host_id)
{
#if CONFIG_LWIP
	struct pbuf *p = (struct pbuf *)host_id;

	if (p)
		pbuf_free(p);
#else
	ke_free((void *)host_id);
#endif
}

/*
 * FIXME: BK7236, don't free buff_addr when lwip is used or monitor.
 */
void fhost_rx_desc_handler(struct rxu_stat_val *rxstat)
{
	uint16_t status = rxstat->status;
	struct fhost_rx_header *rxhdr;
	struct pbuf *p;
	uint32_t host_id;

	host_id = rxstat->host_id;
	p = (struct pbuf *)rxstat->host_id;

	rxhdr = (struct fhost_rx_header *)(p->payload);

	/* Check if we need to delete the buffer */
	if (status & RX_STAT_DELETE) {
		fhost_free_rx_buffer(host_id);
		goto end;
	}

	/* Check if we need to forward the buffer coming from a monitor interface */
	if (status & RX_STAT_MONITOR) {
		if (g_rwnx_connector.monitor_outbound_func /* && rxhdr->hwvect.len >= 24*/)  // e.g. rwm_rx_monitor
			g_rwnx_connector.monitor_outbound_func((void *)host_id, rxhdr->hwvect.len);

		/* Only monitor interface exist */
		if (status == RX_STAT_MONITOR) {
			status |= RX_STAT_ALLOC;
			fhost_free_rx_buffer(host_id);
		}
	}

	/* Check if we need to update the length */
	if (status & RX_STAT_LEN_UPDATE) {
		rxhdr->hwvect.len = rxstat->frame_len;

		if (status & RX_STAT_ETH_LEN_UPDATE) {
			/* Update Length Field inside the Ethernet Header */
			struct ethhdr  *hdr = (struct ethhdr  *)((uint8_t *)rxhdr + sizeof(struct fhost_rx_header));
			hdr->proto = htons(rxstat->frame_len - sizeof(struct ethhdr));
		}
		goto end;
	}

	/* Check if it must be discarded after informing upper layer */
	if (status & RX_STAT_SPURIOUS) {
		if (g_rwnx_connector.spurious_outbound_func)
			g_rwnx_connector.spurious_outbound_func((void *)host_id, rxhdr->hwvect.len);

		if (fhost_rxbuf_repush(host_id))
			pbuf_free((struct pbuf *)host_id);

		goto end;
	}

	/* Check if we need to forward the buffer */
	if (status & RX_STAT_FORWARD) {
		if (g_rwnx_connector.data_outbound_func)  //rwm_upload_data
			g_rwnx_connector.data_outbound_func((void *)host_id, rxhdr->hwvect.len);
		RX_STAT_INC(data_forward);
	}

	/* Check if we need to allocate a new buffer */
	if (status & RX_STAT_ALLOC)
		fhost_rxbuf_push();

end:
	return;
}
